OpenFOAM-13/tutorials/multiRegion/CHT/engine2Valve2D/0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0/fluid";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    mappedWalls
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    NCMWbase
    {
        type            movingWallSlipVelocity;
        value           uniform (0 0 0);
    }

    nonConformalError
    {
        type            nonConformalError;
    }

    "nonCouple.*"
    {
        type            movingWallSlipVelocity;
        value           uniform (0 0 0);
    }

    ".*_on_.*"
    {
        type            movingMappedWallVelocity;
        value           uniform (0 0 0);
    }

    inlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
