OpenFOAM-13/tutorials/multiRegion/CHT/engine2Valve2D/0/liner/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/liner";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 473.15;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    externalWalls
    {
        type            zeroGradient;
    }

    mappedWalls
    {
        type            coupledTemperature;
        value           $internalField;
    }

    NCMWbase
    {
        type            zeroGradient;
    }

    "nonCouple.*"
    {
        type            zeroGradient;
    }

    ".*_on_.*"
    {
        type            coupledTemperature;
        value           $internalField;
    }

    "NonConformalError.*"
    {
        type            nonConformalError;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
